app/controllers/cabanas_controller.rb

    def show
        @cabana = Cabana.find(params[:id])
        $cab = Cabana.find(params[:id])
        $cabanaid = @cabana.id
        $cabananombre = @cabana.nombre
        @reservas = Reserva.all
---
SELECT "cabanas".* FROM "cabanas" WHERE "cabanas"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "cabanas".* FROM "cabanas" WHERE "cabanas"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "reservas".* FROM "reservas"