app/controllers/reservas_controller.rb

  def index
    @reservas = Reserva.all
---
SELECT "reservas".* FROM "reservas"

  def create
    @reserva = Reserva.new(reserva_params)
    #@reserva = Reserva.new(params[:reserva])
    @reserva.id_usuario = current_user.id
    @reserva.id_cabana = $cabanaid
    @reserva.nombre_cabana = $cabananombre

    respond_to do |format|
      if @reserva.save
---
INSERT INTO "reservas" ("id_usuario", "id_cabana", "start_time", "end_time", "nombre_cabana", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @reserva.destroy
---
DELETE FROM "reservas" WHERE "reservas"."id" = $1  [["id", 1]]

    def set_reserva
      @reserva = Reserva.find(params[:id])
---
SELECT "reservas".* FROM "reservas" WHERE "reservas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]