app/models/reserva.rb

    def overlapping
        result = true
        if self.start_time.blank? || self.end_time.blank?
            errors.add(:start_time, 'it overlaps another reservation')
            puts "if7"

        else
            puts "inicio del else"
            Reserva.pluck(:start_time, :end_time, :id_cabana).each do |date_range|
---
SELECT "reservas"."start_time", "reservas"."end_time" FROM "reservas"
SELECT "reservas"."start_time", "reservas"."end_time", "reservas"."id_cabana" FROM "reservas"